ExchangePlans/ОбменСУРМК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<ExchangePlan>
		<Properties>
			<Name>ОбменСУРМК</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВариантНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияФорматаОбмена</Name>
					<Comment>Версия формата обмена в формате ХХ.ХХ.ХХ.ХХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВидЦенУРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьЗаказы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьОстаткиНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьСерии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьТолькоТоварыПалитры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьФизическихЛиц</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьФизическихЛицЧастично</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаВыгрузкиДокументов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзмененыНастройкиУзла</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОтборПоОрганизациям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрироватьИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВыгрузкиПриНеобходимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыВыгрузкиОбъектовОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговыйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТорговыйОбъектУРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКассаВозврата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКонтрагентВозврата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УРМК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УниверсальныеРабочиеМестаКассиров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьКартыЛояльностиВРМК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьШаблоныЧеков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЧекаПродажи</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ХранилищеШаблоновРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЧекаВозврата</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ХранилищеШаблоновРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Организации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОрганизацияУРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КассыККМ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КассаККМ</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КассаККМУРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьНастройкиВозвратаРасширенногоРежима</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОрганизацияУРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КассаВозврата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокФизическихЛицДляВыгрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПалитрыТоваровДляВыгрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПалитраТоваровРМК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПалитраТоваровРМК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаНастройкиПользователей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСотрудника</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>13</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СотрудникСсылка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПользовательСсылка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПользовательСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

Catalogs/УниверсальныеРабочиеМестаКассиров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>УниверсальныеРабочиеМестаКассиров</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТорговыйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТорговыйОбъектУРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппыКатегории</Name>
					<Comment>Настройка распределения продаж номенклатуры по группам, либо категориям</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КассыККМ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КассаККМ</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КассаККМУРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РаспределениеНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КатегорияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпециальныйНалоговыйРежим</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпециальныеНалоговыеРежимы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Патент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Патенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КассаККМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчетНДС</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗанятости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗанятости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетРасчетовСПерсоналом</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетРасчетовСПодотчетниками</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетРасчетовПоПерерасходу</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтрихКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МагнитныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийПроцентСевернойНадбавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННВведенКорректно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ExchangePlans/ОбменСУРМК/Forms/ФормаУзла/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьРасширенныйРежимНастройкиУРМК = ИнтеграцияУРМКСлужебный.ИспользоватьРасширенныйРежимНастройкиУРМК();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьФорму();
	УстановитьДоступностьВыгрузкиТоваровПалитры();
	УстановитьДоступностьВидаЦен();
	УстановитьДоступностьШаблоновЧекаККТ();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;

	Оповестить("Запись_УзелПланаОбмена");
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ОбменДаннымиСервер.ФормаУзлаПриЗаписиНаСервере(ТекущийОбъект, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ОбменДаннымиКлиент.ФормаНастройкиПередЗакрытием(Отказ, ЭтотОбъект, ЗавершениеРаботы);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПустаяСсылкаКассаККМ = Метаданные.ОпределяемыеТипы.КассаККМУРМК.Тип.ПривестиЗначение();
	ПустаяСсылкаОрганизация = Метаданные.ОпределяемыеТипы.ОрганизацияУРМК.Тип.ПривестиЗначение();
	
	ОрганизацияТипРеквизитаСтрокой = ОбщегоНазначения.СтроковоеПредставлениеТипа(ТипЗнч(ПустаяСсылкаОрганизация));
	ИмяРеквизитаОрганизация = ИнтеграцияУРМКСлужебный.ИменаРеквизитовПоТипу(ПустаяСсылкаКассаККМ, Тип(ОрганизацияТипРеквизитаСтрокой));
	
	Если ИмяРеквизитаОрганизация = "" Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаДанных Из Объект.КассыККМ Цикл
		Если Объект.Организации.Количество() > 0 Тогда
			СтрокаДанных.Организация = СтрокаДанных.КассаККМ[ИмяРеквизитаОрганизация];
		КонецЕсли;
	КонецЦикла;
	ЗаполнитьДанныеОтображенияНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ОбновлениеОтборовНаУзле" Тогда
		ЭтотОбъект.Прочитать();
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВыгружатьЗаказыПриИзменении(Элемент)
	ВыгружатьЗаказыПриИзмененииКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ВыгружатьШаблоныЧековПриИзменении(Элемент)
	
	УстановитьДоступностьШаблоновЧекаККТ();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИзменитьСоставКассККМ(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", Объект.УРМК);
	
	ОткрытьФорму("Справочник.УниверсальныеРабочиеМестаКассиров.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПалитру(Команда)
	
	Объект.ПалитрыТоваровДляВыгрузки.Добавить();
	ТекущийЭлемент = Элементы.ПалитрыТоваровДляВыгрузки;
	ПоследняяСтрока = Объект.ПалитрыТоваровДляВыгрузки.Получить(Объект.ПалитрыТоваровДляВыгрузки.Количество() - 1);
	Элементы.ПалитрыТоваровДляВыгрузки.ТекущаяСтрока = ПоследняяСтрока.ПолучитьИдентификатор();
	Элементы.ПалитрыТоваровДляВыгрузки.ТекущийЭлемент = Элементы.ПалитрыТоваровДляВыгрузкиПалитраТоваровРМК;
	Элементы.ПалитрыТоваровДляВыгрузки.ИзменитьСтроку();

КонецПроцедуры

&НаКлиенте
Процедура ПереместитьПалитруВверх(Команда)
	
	Если Не Элементы.ПалитрыТоваровДляВыгрузки.ТекущиеДанные = Неопределено Тогда
		ИндексТекущейСтроки = Объект.ПалитрыТоваровДляВыгрузки.Индекс(Элементы.ПалитрыТоваровДляВыгрузки.ТекущиеДанные);
		Если ИндексТекущейСтроки > 0 Тогда
			Объект.ПалитрыТоваровДляВыгрузки.Сдвинуть(ИндексТекущейСтроки, -1);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьПалитруВниз(Команда)
	
	Если Не Элементы.ПалитрыТоваровДляВыгрузки.ТекущиеДанные = Неопределено Тогда
		ИндексТекущейСтроки = Объект.ПалитрыТоваровДляВыгрузки.Индекс(Элементы.ПалитрыТоваровДляВыгрузки.ТекущиеДанные);
		Если ИндексТекущейСтроки < Объект.ПалитрыТоваровДляВыгрузки.Количество() - 1 Тогда
			Объект.ПалитрыТоваровДляВыгрузки.Сдвинуть(ИндексТекущейСтроки, 1);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НастроитьФорму()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаЭлементыРасширенногоРежима",
		"Видимость",
		ИспользоватьРасширенныйРежимНастройкиУРМК);
		
	УстановитьДоступностьКоманды();
	СформироватьЗаголовокКомандыПодбора();
	УстановитьВидимостьЭлементовНастроекПользователей();
	
КонецПроцедуры

#Область РаботаСФизическимиЛицами

&НаКлиенте
Процедура ПодобратьФизическихЛиц(Команда)
	
	ОбработкаОповещения = Новый ОписаниеОповещения("ВыборСпискаФизическихЛиц", ЭтаФорма);
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("АдресТаблицыФизическихЛиц", ВернутьАдресВременногоХранилищаТаблицыФизическихЛиц());
	
	ОткрытьФорму("ПланОбмена.ОбменСУРМК.Форма.ФормаПодбораФизическихЛиц", ПараметрыОткрытияФормы,ЭтаФорма, Новый УникальныйИдентификатор,
		, ,ОбработкаОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборСпискаФизическихЛиц(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоЗаписейДо = Объект.СписокФизическихЛицДляВыгрузки.Количество();
	ЗагрузитьТаблицуФизическихЛиц(Результат);
	КоличествоЗаписейПосле = Объект.СписокФизическихЛицДляВыгрузки.Количество();
	
	Если КоличествоЗаписейДо <> КоличествоЗаписейПосле Тогда
		Модифицированность = Истина;
		СформироватьЗаголовокКомандыПодбора();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТаблицуФизическихЛиц(АдресВременногоХранилища)
	
	ТаблицаФизЛиц = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	
	Если ТаблицаФизЛиц.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Объект.СписокФизическихЛицДляВыгрузки.Загрузить(ТаблицаФизЛиц);
	
КонецПроцедуры

&НаСервере
Функция ВернутьАдресВременногоХранилищаТаблицыФизическихЛиц()
	
	Возврат ПоместитьВоВременноеХранилище(Объект.СписокФизическихЛицДляВыгрузки.Выгрузить());
	
КонецФункции

&НаКлиенте
Процедура УстановитьДоступностьКоманды()
	
	Элементы.ПодобратьФизическихЛиц.Доступность = Объект.ВыгружатьФизическихЛицЧастично;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгружатьФизическихЛицПриИзменении(Элемент)
	
	Если Объект.ВыгружатьФизическихЛиц Тогда
		Объект.ВыгружатьФизическихЛицЧастично = Ложь;
	КонецЕсли;
	
	УстановитьДоступностьКоманды();
	УстановитьВидимостьЭлементовНастроекПользователей();
КонецПроцедуры

&НаКлиенте
Процедура ВыгружатьФизическихЛицЧастичноПриИзменении(Элемент)
	
	Если Объект.ВыгружатьФизическихЛицЧастично Тогда
		Объект.ВыгружатьФизическихЛиц = Ложь;
	КонецЕсли;
	УстановитьДоступностьКоманды();
	СформироватьЗаголовокКомандыПодбора();
	УстановитьВидимостьЭлементовНастроекПользователей();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗаголовокКомандыПодбора()
	КоличествоЗаписей = Объект.СписокФизическихЛицДляВыгрузки.Количество();
	Если КоличествоЗаписей = 0 ИЛИ НЕ Объект.ВыгружатьФизическихЛицЧастично Тогда
		ЗаголовокКоманды = НСтр("ru = 'Подобрать'");
	Иначе
		ЗаголовокКоманды = СтрШаблон(НСтр("ru = 'Список физических лиц (количество: %1)'"), КоличествоЗаписей);
	КонецЕсли;
	
	Элементы.ПодобратьФизическихЛиц.Заголовок = ЗаголовокКоманды;
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ВыгружатьЗаказыПриИзмененииКлиент()
	
	Если Объект.ВыгружатьЗаказы И Объект.ВыгружатьТолькоТоварыПалитры Тогда
		
		Объект.ВыгружатьЗаказы = Ложь;
		Элементы.Страницы.ТекущаяСтраница = Элементы.ПалитрыТоваровДляОтправки;
		ТекстПредупреждения = НСтр("ru = 'Нельзя выгружать заказы, когда включен признак ""Выгружать только товары палитры"".'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстПредупреждения, , , "Объект.ВыгружатьТолькоТоварыПалитры");
		
	Иначе
		УстановитьДоступностьВыгрузкиТоваровПалитры();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьВыгрузкиТоваровПалитры()
	
	Элементы.ВыгружатьТолькоТоварыПалитры.Доступность = Не Объект.ВыгружатьЗаказы;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьВидаЦен()
	
	Элементы.ВидЦен.ТолькоПросмотр = Объект.ИзмененыНастройкиУзла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьШаблоновЧекаККТ()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаШаблоныЧекаККТ",
		"Доступность",
		Объект.ВыгружатьШаблоныЧеков);
		
	Если НЕ Объект.ВыгружатьШаблоныЧеков Тогда
		
		Объект.ШаблонЧекаПродажи  = Неопределено;
		Объект.ШаблонЧекаВозврата = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры


#Область НастройкиРабочегоМестаКассира

&НаКлиенте
Процедура УстановитьВидимостьЭлементовНастроекПользователей()
	УстановленаНастройкаВыгрузкиФизЛиц = Объект.ВыгружатьФизическихЛиц Или Объект.ВыгружатьФизическихЛицЧастично;
	Элементы.ТаблицаНастройкиПользователейФизическоеЛицо.Видимость = УстановленаНастройкаВыгрузкиФизЛиц;
	Если УстановленаНастройкаВыгрузкиФизЛиц Тогда
		МассивТип = Новый Массив;
		МассивТип.Добавить(Тип("СправочникСсылка.Сотрудники"));
		ОписаниеТипа = Новый ОписаниеТипов(МассивТип);
		Элементы.ТаблицаНастройкиПользователейСотрудник.ОграничениеТипа = ОписаниеТипа;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьНастройкиПоВыбранномуСотруднику(СтруктураСтроки)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА Сотрудники.ШтрихКод = """"
	|			ТОГДА Сотрудники.МагнитныйКод
	|		ИНАЧЕ Сотрудники.ШтрихКод
	|	КОНЕЦ КАК КодСотрудника,
	|	ЕСТЬNULL(Пользователи.Ссылка, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОсновнойПользователь
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО Сотрудники.Физлицо = Пользователи.ФизическоеЛицо
	|ГДЕ
	|	Сотрудники.Ссылка = &ВыбранныйСотрудник";
	Запрос.УстановитьПараметр("ВыбранныйСотрудник", СтруктураСтроки.Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(СтруктураСтроки, Выборка);
			Если Пользователи.РолиДоступны("ПолныеПрава", Выборка.ОсновнойПользователь) Тогда
				СтруктураСтроки.Роль = "Администратор";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастройкиПользователейСотрудникПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТаблицаНастройкиПользователей.ТекущиеДанные;
	Сотрудник = ТекущаяСтрока.СотрудникСсылка;
	СтруктураСтроки = Новый Структура;
	СтруктураСтроки.Вставить("Сотрудник", Сотрудник);
	СтруктураСтроки.Вставить("ФизическоеЛицо", ТекущаяСтрока.ФизическоеЛицо);
	СтруктураСтроки.Вставить("КодСотрудника", ТекущаяСтрока.КодСотрудника);
	СтруктураСтроки.Вставить("ОсновнойПользователь", ТекущаяСтрока.ОсновнойПользователь);
	СтруктураСтроки.Вставить("Роль", "");
	УстановитьНастройкиПоВыбранномуСотруднику(СтруктураСтроки);
	ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтруктураСтроки);
	Если НЕ ТекущаяСтрока.ФизическоеЛицо.Пустая()
		И Объект.ВыгружатьФизическихЛицЧастично Тогда
		ДобавитьФизическоеЛицоВСписокКВыгрузке(ТекущаяСтрока.ФизическоеЛицо);
	КонецЕсли;
	Если ТипЗнч(ТекущаяСтрока.ОсновнойПользователь) = Тип("СправочникСсылка.Пользователи") Тогда
		ТекущаяСтрока.ПользовательСсылка = ТекущаяСтрока.ОсновнойПользователь;
		ТекущаяСтрока.ПользовательСтрока = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФизическоеЛицоВСписокКВыгрузке(ФизическоеЛицо)
	СтрокиПоиска = Объект.СписокФизическихЛицДляВыгрузки.НайтиСтроки(Новый Структура("ФизическоеЛицо", ФизическоеЛицо));
	Если СтрокиПоиска.Количество() = 0 Тогда
		НоваяСтрока = Объект.СписокФизическихЛицДляВыгрузки.Добавить();
		НоваяСтрока.ФизическоеЛицо = ФизическоеЛицо;
		СформироватьЗаголовокКомандыПодбора();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастройкиПользователейФизическоеЛицоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТаблицаНастройкиПользователей.ТекущиеДанные;
	Если НЕ ТекущаяСтрока.ФизическоеЛицо.Пустая()
		И Объект.ВыгружатьФизическихЛицЧастично Тогда
		ДобавитьФизическоеЛицоВСписокКВыгрузке(ТекущаяСтрока.ФизическоеЛицо);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастройкиПользователейОсновнойПользовательПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТаблицаНастройкиПользователей.ТекущиеДанные;
	Если ТипЗнч(ТекущаяСтрока.ОсновнойПользователь) = Тип("СправочникСсылка.Пользователи") Тогда
		ТекущаяСтрока.ПользовательСсылка = ТекущаяСтрока.ОсновнойПользователь;
		ТекущаяСтрока.ПользовательСтрока = "";
	Иначе
		ТекущаяСтрока.ПользовательСсылка = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
		ТекущаяСтрока.ПользовательСтрока = ТекущаяСтрока.ОсновнойПользователь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеОтображенияНастроек()
	Для Каждого СтрокаТаблицы Из Объект.ТаблицаНастройкиПользователей Цикл
		Если Не ПустаяСтрока(СтрокаТаблицы.ПользовательСтрока) Тогда
			СтрокаТаблицы.ОсновнойПользователь = СтрокаТаблицы.ПользовательСтрока;
		Иначе
			СтрокаТаблицы.ОсновнойПользователь = СтрокаТаблицы.ПользовательСсылка;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЗаполнитьДанныеОтображенияНастроек();
КонецПроцедуры
#КонецОбласти

#КонецОбласти
